# -*- coding: utf-8 -*-
# @Time    : 2019/4/14  0:17
# @Author  : 史哲磊
# @Email   : sidian305@163.com
# @File    : 学生成绩单
# @Software: PyCharm
scores = [
# 学号 姓名 语文 数学 英语
    ["001","李 明","语文92.5分","数学93分","英语94分。"],
    ["002","王小笑","语文86分","数学91分","英语99分。"],
    ["003","郑 准","语文94.5分","数学93分","英语88分。"],
    ["004""张大明","语文86.5分","数学81分","英语87分。"],
    ["005","田 甜","语文80.5分","数学85分","英语80分。"],
    ["006","李 娇","语文78分","数学86分","英语80分。"],
    ["007","王 晗","语文79.5分","数学77分","英语76分。"],
    ["008","耿文俊","语文95分","数学88分","英语92分。"],
    ["009","章 蕊","语文99分","数学98分","英语90分。"],
    ["010","童泽松","语文88分","数学94分","英语98分。"]
     ]
for student in scores:
    # print(student)
    total = 0
    for j in range(2,5):
        total += student[j]
    student.append(total)
    print(student)